TF Plan in crissupb for new Lambda alarms
```
# module.kms_logging.module.ct-processor-github-alerts.aws_cloudwatch_metric_alarm.lambda_error_rate[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_error_rate" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:894947205914:slack-otherevents",
        ]
      + alarm_description                     = "Lambda error rate has exceeded 5%"
      + alarm_name                            = "Lambda error rate: crissupb-cloudtrail-kms"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "errors"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "FunctionName" = "crissupb-cloudtrail-kms"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + id          = "invocations"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "FunctionName" = "crissupb-cloudtrail-kms"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + expression  = "errors / invocations * 100"
          + id          = "error_rate"
          + label       = "Error Rate"
          + return_data = true
        }
    }

  # module.kms_logging.module.cw-processor-github-alerts.aws_cloudwatch_metric_alarm.lambda_error_rate[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_error_rate" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:894947205914:slack-otherevents",
        ]
      + alarm_description                     = "Lambda error rate has exceeded 5%"
      + alarm_name                            = "Lambda error rate: crissupb-cloudwatch-kms"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "errors"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "FunctionName" = "crissupb-cloudwatch-kms"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + id          = "invocations"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "FunctionName" = "crissupb-cloudwatch-kms"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + expression  = "errors / invocations * 100"
          + id          = "error_rate"
          + label       = "Error Rate"
          + return_data = true
        }
    }

```